Table of Contents
 Class ConcreteULSCheckResultShearEc2
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
ULS Check Shear Ec2
public class ConcreteULSCheckResultShearEc2 : ConcreteULSCheckResultShear
Inheritance
object
ConcreteCheckResultBase
ConcreteULSCheckResultShear
ConcreteULSCheckResultShearEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Ved
shear force
public double Ved { get; set; }
Property Value
double
 Vrd
decisive shear resistance
public double Vrd { get; set; }
Property Value
double
 Vrdc
shear resistance of concrete
public double Vrdc { get; set; }
Property Value
double
 Vrdmax
shear resistance of compression strut
public double Vrdmax { get; set; }
Property Value
double
 Vrdr
shear resistance
public double Vrdr { get; set; }
Property Value
double
 Vrds
shear resistance of shear reinforcement
public double Vrds { get; set; }
Property Value
double
 Edit this page